In [23]:
import pandas as pd
users_data=pd.read_csv("users_data.csv",index_col=0)
users_data

         name gender  age marital_status     city  salary
1       Alice      F   28        Married   Boston   60769
2         Bob      M   41         Single   Boston  119735
3     Charlie      M   36        Married   Boston  122955
4       David      M   32       Divorced  Chicago  124925
5         Eva      F   29       Divorced  Seattle  127969
6       Frank      M   42         Single  Seattle   65311
7       Grace      F   28       Divorced       NY  163355
8       Henry      M   47       Divorced  Chicago  164724
9         Ivy      F   40        Married   Austin  143104
10       Jack      M   44         Single  Chicago  113707
11  Katherine      F   32        Married   Austin  145305
12        Leo      M   32        Married       NY   88693
13        Mia      F   45        Married       LA  131932
14       Noah      M   42        Married  Seattle  153016
15     Olivia      F   25        Married       NY  166970
16      Peter      M   29        Married  Seattle   85658
17      Quinn      F   45        Married   Boston  144478
18     Rachel      F   24         Single       LA   78431
19        Sam      M   43       Divorced       LA   62747
20     Taylor      F   42        Married       NY  119150

In [4]:
users_data[['name','age','city']]

         name  age     city
0       Alice   28   Boston
1         Bob   41   Boston
2     Charlie   36   Boston
3       David   32  Chicago
4         Eva   29  Seattle
5       Frank   42  Seattle
6       Grace   28       NY
7       Henry   47  Chicago
8         Ivy   40   Austin
9        Jack   44  Chicago
10  Katherine   32   Austin
11        Leo   32       NY
12        Mia   45       LA
13       Noah   42  Seattle
14     Olivia   25       NY
15      Peter   29  Seattle
16      Quinn   45   Boston
17     Rachel   24       LA
18        Sam   43       LA
19     Taylor   42       NY

In [5]:
users_data['city'].value_counts().sort_index()

city
Austin     2
Boston     4
Chicago    3
LA         3
NY         4
Seattle    4
Name: count, dtype: int64

In [3]:
users_data['marital_status'].value_counts()

marital_status
Married     11
Divorced     5
Single       4
Name: count, dtype: int64

In [4]:
users_data['gender'].value_counts()

gender
F    10
M    10
Name: count, dtype: int64

In [7]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     object
 1   gender          20 non-null     object
 2   age             20 non-null     int64
 3   marital_status  20 non-null     object
 4   city            20 non-null     object
 5   salary          20 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [8]:
users_data.describe()

             age         salary
count  20.000000      20.000000
mean   36.300000  119146.700000
std     7.547045   34700.769094
min    24.000000   60769.000000
25%    29.000000   87934.250000
50%    38.000000  123940.000000
75%    42.250000  144684.750000
max    47.000000  166970.000000

In [9]:
users_data.describe(include='object')

         name gender marital_status    city
count      20     20             20      20
unique     20      2              3       6
top     Alice      F        Married  Boston
freq        1     10             11       4

In [10]:
users_data['city'].count()

np.int64(20)

In [11]:
users_data['city'].unique()

array(['Boston', 'Chicago', 'Seattle', 'NY', 'Austin', 'LA'], dtype=object)

In [12]:
users_data['city'].nunique()

6

In [13]:
users_data.describe(include='all')

         name gender        age marital_status    city         salary
count      20     20  20.000000             20      20      20.000000
unique     20      2        NaN              3       6            NaN
top     Alice      F        NaN        Married  Boston            NaN
freq        1     10        NaN             11       4            NaN
mean      NaN    NaN  36.300000            NaN     NaN  119146.700000
std       NaN    NaN   7.547045            NaN     NaN   34700.769094
min       NaN    NaN  24.000000            NaN     NaN   60769.000000
25%       NaN    NaN  29.000000            NaN     NaN   87934.250000
50%       NaN    NaN  38.000000            NaN     NaN  123940.000000
75%       NaN    NaN  42.250000            NaN     NaN  144684.750000
max       NaN    NaN  47.000000            NaN     NaN  166970.000000

In [14]:
users_data.describe()

             age         salary
count  20.000000      20.000000
mean   36.300000  119146.700000
std     7.547045   34700.769094
min    24.000000   60769.000000
25%    29.000000   87934.250000
50%    38.000000  123940.000000
75%    42.250000  144684.750000
max    47.000000  166970.000000

In [15]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     object
 1   gender          20 non-null     object
 2   age             20 non-null     int64
 3   marital_status  20 non-null     object
 4   city            20 non-null     object
 5   salary          20 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [16]:
users_data['gender'] = users_data['gender'].astype('category')

In [17]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     object
 1   gender          20 non-null     category
 2   age             20 non-null     int64
 3   marital_status  20 non-null     object
 4   city            20 non-null     object
 5   salary          20 non-null     int64
dtypes: category(1), int64(2), object(3)
memory usage: 1.1+ KB

In [19]:
users_data['name']=users_data['name'].astype('category')
users_data['marital_status']=users_data['marital_status'].astype('category')
users_data['city']=users_data['city'].astype('category')

In [20]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     category
 1   gender          20 non-null     category
 2   age             20 non-null     int64
 3   marital_status  20 non-null     category
 4   city            20 non-null     category
 5   salary          20 non-null     int64
dtypes: category(4), int64(2)
memory usage: 1.7 KB

In [21]:
users_data.index

Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20], dtype='int64')

In [22]:
users_data['city'].value_counts()

city
Boston     4
NY         4
Seattle    4
Chicago    3
LA         3
Austin     2
Name: count, dtype: int64

In [47]:
#sort data by age
users_data=(
    users_data
     .sort_values(by="salary",ascending=False)
     .reset_index(drop=True)
)
users_data.index=users_data.index+1
users_data

         name gender  age marital_status     city  salary
1      Olivia      F   25        Married       NY  166970
2       Henry      M   47       Divorced  Chicago  164724
3       Grace      F   28       Divorced       NY  163355
4        Noah      M   42        Married  Seattle  153016
5   Katherine      F   32        Married   Austin  145305
6       Quinn      F   45        Married   Boston  144478
7         Ivy      F   40        Married   Austin  143104
8         Mia      F   45        Married       LA  131932
9         Eva      F   29       Divorced  Seattle  127969
10      David      M   32       Divorced  Chicago  124925
11    Charlie      M   36        Married   Boston  122955
12        Bob      M   41         Single   Boston  119735
13     Taylor      F   42        Married       NY  119150
14       Jack      M   44         Single  Chicago  113707
15        Leo      M   32        Married       NY   88693
16      Peter      M   29        Married  Seattle   85658
17     Rachel      F   24         Single       LA   78431
18      Frank      M   42         Single  Seattle   65311
19        Sam      M   43       Divorced       LA   62747
20      Alice      F   28        Married   Boston   60769

In [50]:
users_data=(
  users_data
    .sort_values(by=["age","salary"],ascending=[True,False])
    .reset_index(drop=True)
    
)
users_data.index=range(1,len(users_data)+1)
#display results
users_data

         name gender  age marital_status     city  salary
1      Rachel      F   24         Single       LA   78431
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
5         Eva      F   29       Divorced  Seattle  127969
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
15      Frank      M   42         Single  Seattle   65311
16        Sam      M   43       Divorced       LA   62747
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [55]:
users_data.loc[1]

name              Rachel
gender                 F
age                   24
marital_status    Single
city                  LA
salary             78431
Name: 1, dtype: object

In [56]:
users_data.loc[5]

name                   Eva
gender                   F
age                     29
marital_status    Divorced
city               Seattle
salary              127969
Name: 5, dtype: object

In [61]:
users_data.loc[[1,3,6,8],["name","city","salary"]]

     name     city  salary
1  Rachel       LA   78431
3   Grace       NY  163355
6   Peter  Seattle   85658
8   David  Chicago  124925

In [67]:
users_data.loc[1:6,"salary"]

1     78431
2    166970
3    163355
4     60769
5    127969
6     85658
Name: salary, dtype: int64

In [68]:
users_data.iloc[1]

name               Olivia
gender                  F
age                    25
marital_status    Married
city                   NY
salary             166970
Name: 2, dtype: object

In [70]:
users_data.iloc[6]

name              Katherine
gender                    F
age                      32
marital_status      Married
city                 Austin
salary               145305
Name: 7, dtype: object

In [74]:
users_data.iloc[[0,2,5],[1,3,5]]

  gender marital_status  salary
1      F         Single   78431
3      F       Divorced  163355
6      M        Married   85658

In [72]:
users_data

         name gender  age marital_status     city  salary
1      Rachel      F   24         Single       LA   78431
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
5         Eva      F   29       Divorced  Seattle  127969
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
15      Frank      M   42         Single  Seattle   65311
16        Sam      M   43       Divorced       LA   62747
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [80]:
users_data.iloc[0:7,[0,2,3]]

        name  age marital_status
1     Rachel   24         Single
2     Olivia   25        Married
3      Grace   28       Divorced
4      Alice   28        Married
5        Eva   29       Divorced
6      Peter   29        Married
7  Katherine   32        Married

In [81]:
users_data.loc[1:3,["name","age","salary"]]

     name  age  salary
1  Rachel   24   78431
2  Olivia   25  166970
3   Grace   28  163355

In [90]:
users_data.loc[[1,3],"name":"city"]

     name gender  age marital_status city
1  Rachel      F   24         Single   LA
3   Grace      F   28       Divorced   NY

In [92]:
is_married=(users_data['marital_status']=='Married')
users_data[is_married]

         name gender  age marital_status     city  salary
2      Olivia      F   25        Married       NY  166970
4       Alice      F   28        Married   Boston   60769
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932

In [96]:
salary_above_120000=(users_data['salary']>=120000)
users_data[salary_above_120000]

         name gender  age marital_status     city  salary
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
5         Eva      F   29       Divorced  Seattle  127969
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
13       Noah      M   42        Married  Seattle  153016
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [97]:
users_data

         name gender  age marital_status     city  salary
1      Rachel      F   24         Single       LA   78431
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
5         Eva      F   29       Divorced  Seattle  127969
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
15      Frank      M   42         Single  Seattle   65311
16        Sam      M   43       Divorced       LA   62747
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [98]:
#select users from seattle
users_from_seattle=(users_data['city']=='Seattle')
users_from_seattle

1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15     True
16    False
17    False
18    False
19    False
20    False
Name: city, dtype: bool

In [99]:
#select only rows where users come from seattle
users_data[users_from_seattle]

     name gender  age marital_status     city  salary
5     Eva      F   29       Divorced  Seattle  127969
6   Peter      M   29        Married  Seattle   85658
13   Noah      M   42        Married  Seattle  153016
15  Frank      M   42         Single  Seattle   65311

In [101]:
#select users from seattle
#select only users with 29 years
users_from_seattle_city=(users_data['city']=='Seattle')
user_years_equal_to_29=(users_data['age']==29)
users_from_seattle_city

1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15     True
16    False
17    False
18    False
19    False
20    False
Name: city, dtype: bool

In [102]:
users_data[users_from_seattle_city]

     name gender  age marital_status     city  salary
5     Eva      F   29       Divorced  Seattle  127969
6   Peter      M   29        Married  Seattle   85658
13   Noah      M   42        Married  Seattle  153016
15  Frank      M   42         Single  Seattle   65311

In [103]:
user_years_equal_to_29

1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
Name: age, dtype: bool

In [104]:
#data for users from seattle city whose age is equal to 29 years old
users_data[user_years_equal_to_29]

    name gender  age marital_status     city  salary
5    Eva      F   29       Divorced  Seattle  127969
6  Peter      M   29        Married  Seattle   85658

In [107]:
combined_data=users_from_seattle_city & user_years_equal_to_29
users_data[combined_data]

    name gender  age marital_status     city  salary
5    Eva      F   29       Divorced  Seattle  127969
6  Peter      M   29        Married  Seattle   85658

In [111]:
users_data['city'].value_counts()

city
NY         4
Boston     4
Seattle    4
LA         3
Chicago    3
Austin     2
Name: count, dtype: int64

In [112]:
#select rows with city seattle or city la
city_seattle=(users_data['city']=='Seattle')
city_la=(users_data['city']=='LA')
city_la_or_seattle=city_seattle|city_la
city_la_or_seattle

1      True
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15     True
16     True
17    False
18    False
19     True
20    False
Name: city, dtype: bool

In [114]:
users_data[city_la_or_seattle]

      name gender  age marital_status     city  salary
1   Rachel      F   24         Single       LA   78431
5      Eva      F   29       Divorced  Seattle  127969
6    Peter      M   29        Married  Seattle   85658
13    Noah      M   42        Married  Seattle  153016
15   Frank      M   42         Single  Seattle   65311
16     Sam      M   43       Divorced       LA   62747
19     Mia      F   45        Married       LA  131932

In [118]:
#users not from la or seattle
not_la_or_seattle=~city_la_or_seattle
not_la_or_seattle.value_counts()

city
True     13
False     7
Name: count, dtype: int64

In [116]:
users_data[not_la_or_seattle]

         name gender  age marital_status     city  salary
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
14     Taylor      F   42        Married       NY  119150
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
20      Henry      M   47       Divorced  Chicago  164724

In [120]:
not_la_or_seattle.value_counts()

city
True     13
False     7
Name: count, dtype: int64

In [121]:
users_data[city_seattle|city_la]

      name gender  age marital_status     city  salary
1   Rachel      F   24         Single       LA   78431
5      Eva      F   29       Divorced  Seattle  127969
6    Peter      M   29        Married  Seattle   85658
13    Noah      M   42        Married  Seattle  153016
15   Frank      M   42         Single  Seattle   65311
16     Sam      M   43       Divorced       LA   62747
19     Mia      F   45        Married       LA  131932

In [122]:
users_data[users_from_seattle_city & user_years_equal_to_29]

    name gender  age marital_status     city  salary
5    Eva      F   29       Divorced  Seattle  127969
6  Peter      M   29        Married  Seattle   85658

In [123]:
column_mapper={"salary":"annual_salary"}
users_data=users_data.rename(mapper=column_mapper,axis=1)
users_data

         name gender  age marital_status     city  annual_salary
1      Rachel      F   24         Single       LA          78431
2      Olivia      F   25        Married       NY         166970
3       Grace      F   28       Divorced       NY         163355
4       Alice      F   28        Married   Boston          60769
5         Eva      F   29       Divorced  Seattle         127969
6       Peter      M   29        Married  Seattle          85658
7   Katherine      F   32        Married   Austin         145305
8       David      M   32       Divorced  Chicago         124925
9         Leo      M   32        Married       NY          88693
10    Charlie      M   36        Married   Boston         122955
11        Ivy      F   40        Married   Austin         143104
12        Bob      M   41         Single   Boston         119735
13       Noah      M   42        Married  Seattle         153016
14     Taylor      F   42        Married       NY         119150
15      Frank      M   42         Single  Seattle          65311
16        Sam      M   43       Divorced       LA          62747
17       Jack      M   44         Single  Chicago         113707
18      Quinn      F   45        Married   Boston         144478
19        Mia      F   45        Married       LA         131932
20      Henry      M   47       Divorced  Chicago         164724

In [124]:
drop_column_marital_status=["marital_status"]
users_data=users_data.drop(labels=drop_column_marital_status,axis=1)
users_data

         name gender  age     city  annual_salary
1      Rachel      F   24       LA          78431
2      Olivia      F   25       NY         166970
3       Grace      F   28       NY         163355
4       Alice      F   28   Boston          60769
5         Eva      F   29  Seattle         127969
6       Peter      M   29  Seattle          85658
7   Katherine      F   32   Austin         145305
8       David      M   32  Chicago         124925
9         Leo      M   32       NY          88693
10    Charlie      M   36   Boston         122955
11        Ivy      F   40   Austin         143104
12        Bob      M   41   Boston         119735
13       Noah      M   42  Seattle         153016
14     Taylor      F   42       NY         119150
15      Frank      M   42  Seattle          65311
16        Sam      M   43       LA          62747
17       Jack      M   44  Chicago         113707
18      Quinn      F   45   Boston         144478
19        Mia      F   45       LA         131932
20      Henry      M   47  Chicago         164724

In [129]:
user_name_column={"name":"username"}
users_data=users_data.rename(mapper=user_name_column,axis=1)
users_data

     username gender  age     city  annual_salary
1      Rachel      F   24       LA          78431
2      Olivia      F   25       NY         166970
3       Grace      F   28       NY         163355
4       Alice      F   28   Boston          60769
5         Eva      F   29  Seattle         127969
6       Peter      M   29  Seattle          85658
7   Katherine      F   32   Austin         145305
8       David      M   32  Chicago         124925
9         Leo      M   32       NY          88693
10    Charlie      M   36   Boston         122955
11        Ivy      F   40   Austin         143104
12        Bob      M   41   Boston         119735
13       Noah      M   42  Seattle         153016
14     Taylor      F   42       NY         119150
15      Frank      M   42  Seattle          65311
16        Sam      M   43       LA          62747
17       Jack      M   44  Chicago         113707
18      Quinn      F   45   Boston         144478
19        Mia      F   45       LA         131932
20      Henry      M   47  Chicago         164724

In [133]:
users_data.rename(index={1: "user_1", 2: "user_2"}, inplace=True)

users_data

         username gender  age     city  annual_salary
user_1     Rachel      F   24       LA          78431
user_2     Olivia      F   25       NY         166970
3           Grace      F   28       NY         163355
4           Alice      F   28   Boston          60769
5             Eva      F   29  Seattle         127969
6           Peter      M   29  Seattle          85658
7       Katherine      F   32   Austin         145305
8           David      M   32  Chicago         124925
9             Leo      M   32       NY          88693
10        Charlie      M   36   Boston         122955
11            Ivy      F   40   Austin         143104
12            Bob      M   41   Boston         119735
13           Noah      M   42  Seattle         153016
14         Taylor      F   42       NY         119150
15          Frank      M   42  Seattle          65311
16            Sam      M   43       LA          62747
17           Jack      M   44  Chicago         113707
18          Quinn      F   45   Boston         144478
19            Mia      F   45       LA         131932
20          Henry      M   47  Chicago         164724

In [ ]:
users_data